Repository: rifhrzi/Guidely
Catalog: lib/l10n/app_*.arb
Languages: id

# welcomeTitle
source: Welcome to NavMate
id: Selamat datang di NavMate

# welcomeSubtitle
source: Voice-first campus navigation
id: Navigasi kampus berbasis suara

source: Speak Destination
id: Ucapkan Tujuan

# speakDestinationHint
source: Double tap to speak your destination
id: Ketuk dua kali untuk mengucapkan tujuan

source: Favorites
id: Favorit

source: Help
id: Bantuan

source: Recent destinations
id: Tujuan terbaru

# recentVisitedAt
source: Last used at {time}
id: Terakhir digunakan pukul {time}

# homeVoiceWelcome
source: Speak Destination to begin navigation. Quick actions and recent destinations follow.
id: Ucapkan Tujuan untuk mulai bernavigasi. Pintasan dan tujuan terbaru ada di bawah.

# favoritesActionHint
source: Browse your saved campus landmarks.
id: Lihat daftar landmark kampus favorit Anda.

# helpActionHint
source: Hear tips and voice commands for NavMate.
id: Dengar tips dan perintah suara NavMate.

# mapActionHint
source: Open the offline campus map.
id: Buka peta kampus offline.

# settingsActionHint
source: Adjust voice and accessibility preferences.
id: Atur suara dan preferensi aksesibilitas.

# recentReopenHint
source: Double tap to restart navigation to this place.
id: Ketuk dua kali untuk menavigasi lagi ke tempat ini.

# navigationProgress
source: {percent}% complete
id: {percent}% selesai

source: Settings
id: Pengaturan

source: Campus Map
id: Peta Kampus

# speakDestinationTitle
source: Speak Destination
id: Ucapkan Tujuan

source: Listening...
id: Mendengarkan...

source: Say your destination
id: Sebutkan tujuan Anda

source: Listen again
id: Dengar lagi

source: Confirm
id: Konfirmasi

# confirmTitle
source: Confirm
id: Konfirmasi

# didYouSay
source: Did you say '{text}'?
id: Apakah Anda mengatakan '{text}'?

# didYouMean
source: Did you mean: {name}
id: Apakah maksud Anda: {name}

source: No
id: Tidak

source: Yes
id: Ya

source: Try again
id: Coba lagi

source: Confirm destination
id: Konfirmasi tujuan

source: Head towards {name}
id: Menuju ke {name}

source: Navigate to {name}?
id: Navigasi ke {name}?

# sorryNotCatch
source: Sorry, I did not catch that
id: Maaf, saya tidak menangkapnya

# micPermissionDenied
source: Microphone permission denied
id: Izin mikrofon ditolak

source: Listening again
id: Mendengarkan lagi

source: Navigation
id: Navigasi

source: Head towards destination
id: Menuju ke tujuan

# meters
source: {count} meters
id: {count} meter

# arrivedAt
source: You have arrived at {name}
id: Anda telah tiba di {name}

# voiceHintsSetting
source: Voice hints (when TalkBack/VoiceOver is off)
id: Petunjuk suara (saat TalkBack/VoiceOver mati)

# clarityModeSetting
source: Clarity mode (slower, clearer TTS)
id: Mode jelas (TTS lebih lambat dan jelas)

source: Screen reader
id: Pembaca layar

# active
source: Active (TalkBack/VoiceOver)
id: Aktif (TalkBack/VoiceOver)

source: Inactive
id: Tidak aktif

source: Haptics
id: Getaran

source: TTS speed
id: Kecepatan TTS

source: Test voice
id: Uji suara

# talkbackNote
source: Note: TalkBack/VoiceOver speed is controlled by system accessibility settings.
id: Catatan: Kecepatan TalkBack/VoiceOver diatur oleh pengaturan aksesibilitas sistem.

source: Language
id: Bahasa

source: System default
id: Bawaan sistem

source: Indonesian
id: Bahasa Indonesia

source: English
id: Inggris

# helpBody
source: Voice commands: - Speak Destination: Say building or place name. - Repeat: Hear the last instruction again. - Cancel: Stop navigation. Tips: - Keep phone upright for better compass accuracy. - Allow precise location while navigating.
id: Perintah suara: - Ucapkan Tujuan: Sebutkan nama gedung atau tempat. - Ulangi: Dengar ulang instruksi terakhir. - Batalkan: Hentikan navigasi. Tips: - Pegang ponsel tegak untuk akurasi kompas yang lebih baik. - Izinkan lokasi presisi saat navigasi.

# repeatInstruction
source: Repeat
id: Ulangi

# pauseNavigation
source: Pause
id: Jeda

# resumeNavigation
source: Resume
id: Lanjutkan

# endNavigation
source: End
id: Akhiri

# continueForMeters
source: Continue for {count} meters.
id: Lanjutkan sejauh {count} meter.

# offRoute
source: You seem off route. Recalculating...
id: Anda tampaknya keluar jalur. Menghitung ulang...

# gpsSignalLost
source: GPS signal lost. Hold still and try again.
id: Sinyal GPS hilang. Tetap diam dan coba lagi.

# arrivalComplete
source: You have arrived.
id: Anda telah tiba.

# requestingPermission
source: Requesting microphone permission...
id: Meminta izin mikrofon...

# micPermissionDeniedForever
source: Microphone permission permanently denied. Enable it in Settings to use voice input.
id: Izin mikrofon ditolak secara permanen. Aktifkan di Pengaturan untuk menggunakan input suara.

# listeningFailed
source: I couldn't understand that. You can try again or type instead.
id: Saya tidak memahaminya. Anda bisa mencoba lagi atau ketik saja.

# openAppSettings
source: Open Settings
id: Buka Pengaturan

source: Type your destination
id: Ketik tujuan Anda

# enterDestinationHint
source: Enter a building or place name
id: Masukkan nama gedung atau tempat

source: Submit
id: Kirim

source: Report Obstacle
id: Laporkan Hambatan

# reportObstacleHint
source: Report an obstacle or barrier at your current location
id: Laporkan hambatan atau rintangan di lokasi Anda saat ini

# reportObstacleSubtitle
source: Obstacle will be reported at your current location
id: Hambatan akan dilaporkan di lokasi Anda saat ini

source: Obstacle Type
id: Jenis Hambatan

# obstacleDescription
source: Description (optional)
id: Deskripsi (opsional)

# obstacleDescriptionHint
source: Briefly describe the obstacle...
id: Jelaskan hambatan secara singkat...

# obstacleRadius
source: Radius of effect: {meters} meters
id: Radius dampak: {meters} meter

# obstacleExpiration
source: Valid until
id: Berlaku hingga

# obstacleExpirationHint
source: Choose how long this obstacle is active
id: Pilih berapa lama hambatan ini aktif

source: Submit Report
id: Kirim Laporan

# submitReportHint
source: Double tap to submit the obstacle report
id: Ketuk dua kali untuk mengirim laporan hambatan

source: Submitting...
id: Mengirim...

source: Cancel
id: Batal

# reportSuccess
source: Obstacle reported successfully
id: Hambatan berhasil dilaporkan

# reportFailed
source: Failed to report obstacle
id: Gagal melaporkan hambatan

source: No internet connection
id: Tidak ada koneksi internet

source: Service unavailable
id: Layanan tidak tersedia
